In [82]:
import numpy as np
import pandas as pd

In [83]:
# Use this because I couldn't see enough output
pd.set_option('display.max_rows', None)

In [84]:
df_four = pd.read_csv('export_format4.csv')

In [85]:
# Notice the comma in row 4, salary column
df_four.head()

,employer,period_begin,period_end,post_date,salary,sheltered,unsheltered,total
0,Orleans,1/1/2002,1/31/2002,1/29/2002,262.62,0.0,18.38,18.38
1,Orleans,2/1/2002,2/28/2002,2/22/2002,525.24,0.0,36.76,36.76
2,Orleans,3/1/2002,3/31/2002,3/27/2002,525.24,0.0,36.76,36.76
3,Orleans,4/1/2002,4/30/2002,4/26/2002,525.24,0.0,36.76,36.76
4,Orleans,5/1/2002,5/31/2002,6/11/2002,"1,021.93",0.0,71.53,71.53

In [86]:
# Notice Salary is Dtype = object, due to the commas
df_four.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 582 entries, 0 to 581
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   employer      582 non-null    object
 1   period_begin  582 non-null    object
 2   period_end    582 non-null    object
 3   post_date     582 non-null    object
 4   salary        582 non-null    object
 5   sheltered     582 non-null    float64
 6   unsheltered   582 non-null    float64
 7   total         582 non-null    float64
dtypes: float64(3), object(5)
memory usage: 36.5+ KB

In [87]:
# 'salary' column is returning as an 'object' (string) due to the commas
# Remove the commas!
df_four['salary'] = df_four['salary'].str.replace(',', '')
df_four.head()

,employer,period_begin,period_end,post_date,salary,sheltered,unsheltered,total
0,Orleans,1/1/2002,1/31/2002,1/29/2002,262.62,0.0,18.38,18.38
1,Orleans,2/1/2002,2/28/2002,2/22/2002,525.24,0.0,36.76,36.76
2,Orleans,3/1/2002,3/31/2002,3/27/2002,525.24,0.0,36.76,36.76
3,Orleans,4/1/2002,4/30/2002,4/26/2002,525.24,0.0,36.76,36.76
4,Orleans,5/1/2002,5/31/2002,6/11/2002,1021.93,0.0,71.53,71.53

In [88]:
# Now that the commas are gone, we can convert the salary column from string to numeric
df_four['salary'] = pd.to_numeric(df_four['salary'])

In [89]:
# Notice that the salary column is now an object!
df_four.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 582 entries, 0 to 581
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   employer      582 non-null    object
 1   period_begin  582 non-null    object
 2   period_end    582 non-null    object
 3   post_date     582 non-null    object
 4   salary        582 non-null    float64
 5   sheltered     582 non-null    float64
 6   unsheltered   582 non-null    float64
 7   total         582 non-null    float64
dtypes: float64(4), object(4)
memory usage: 36.5+ KB

In [90]:
# Now, we sort by period end
# Because there are exact equal values for period end in both the parish and state salary reports,
# it will combine (sum) both the parish and state per month
df_four = df_four.groupby('period_end').sum()

C:\Users\Admin\AppData\Local\Temp\ipykernel_4716\2359453596.py:4: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_four = df_four.groupby('period_end').sum()

In [91]:
# I am glad I checked my work! Look, the period_end is not in the time order I expected. 
# I expected to see linear time: January through December of one  year, then move to next year
df_four.head()

             salary  sheltered  unsheltered   total
period_end
1/31/2002    525.02       0.00        36.75   36.75
1/31/2003   1274.12       0.00        89.20   89.20
1/31/2004   1458.70       0.00       102.12  102.12
1/31/2005   1625.60     113.80         0.00  113.80
1/31/2006   1520.64     106.44         0.00  106.44

In [92]:
# Use the datetime module to sort my timeline linearly
df_four = df_four.sort_values(by='period_end', key=pd.to_datetime)
df_four.head()

             salary  sheltered  unsheltered   total
period_end
1/31/2002    525.02        0.0        36.75   36.75
2/28/2002   1050.04        0.0        73.50   73.50
3/31/2002   1050.04        0.0        73.50   73.50
4/30/2002   1050.04        0.0        73.50   73.50
5/31/2002   2044.57        0.0       143.13  143.13

In [93]:
# Here we use the rolling 60 mean function built into pandas to return the
# average salaries for each 60 consecutive month periods.
# I am calling head on just 62 rows to make sure it is looking for 60 rows of data to check that the function is working properly
df_four['rolling_60'] = df_four['salary'].rolling(60).mean()
df_four.head(62)

             salary  sheltered  unsheltered   total   rolling_60
period_end
1/31/2002    525.02       0.00        36.75   36.75          NaN
2/28/2002   1050.04       0.00        73.50   73.50          NaN
3/31/2002   1050.04       0.00        73.50   73.50          NaN
4/30/2002   1050.04       0.00        73.50   73.50          NaN
5/31/2002   2044.57       0.00       143.13  143.13          NaN
6/30/2002   1225.60       0.00        85.80   85.80          NaN
7/31/2002   1249.86       0.00        87.50   87.50          NaN
8/31/2002   1274.12       0.00        89.20   89.20          NaN
9/30/2002   1274.12       0.00        89.20   89.20          NaN
10/31/2002  1274.12       0.00        89.20   89.20          NaN
11/30/2002  1911.18       0.00       133.80  133.80          NaN
12/31/2002  1274.12       0.00        89.20   89.20          NaN
1/31/2003   1274.12       0.00        89.20   89.20          NaN
2/28/2003   1274.12       0.00        89.20   89.20          NaN
3/31/2003   1274.12       0.00        89.20   89.20          NaN
4/30/2003   1274.12       0.00        89.20   89.20          NaN
5/31/2003   1911.18       0.00       133.80  133.80          NaN
6/30/2003   1274.12       0.00        89.20   89.20          NaN
7/31/2003   1299.67       0.00        90.98   90.98          NaN
8/31/2003   1325.22       0.00        92.76   92.76          NaN
9/30/2003   1325.22       0.00        92.76   92.76          NaN
10/31/2003  2121.31       0.00       148.50  148.50          NaN
11/30/2003  1458.70       0.00       102.12  102.12          NaN
12/31/2003  1458.70       0.00       102.12  102.12          NaN
1/31/2004   1458.70       0.00       102.12  102.12          NaN
2/28/2004   1458.70       0.00       102.12  102.12          NaN
3/31/2004   1458.70       0.00       102.12  102.12          NaN
4/30/2004   2239.17       0.00       156.75  156.75          NaN
5/31/2004   1560.94       0.00       109.26  109.26          NaN
6/30/2004   1560.94       0.00       109.26  109.26          NaN
7/31/2004   1573.74       0.00       110.15  110.15          NaN
8/31/2004   1638.73       0.00       114.72  114.72          NaN
9/30/2004   1625.60       0.00       113.80  113.80          NaN
10/31/2004  2438.40       0.00       170.70  170.70          NaN
11/30/2004  1625.60       0.00       113.80  113.80          NaN
12/31/2004  1625.60       0.00       113.80  113.80          NaN
1/31/2005   1625.60     113.80         0.00  113.80          NaN
2/28/2005   1625.60     113.80         0.00  113.80          NaN
3/31/2005   1625.60     113.80         0.00  113.80          NaN
4/30/2005   2438.40     170.70         0.00  170.70          NaN
5/31/2005   1625.60     113.80         0.00  113.80          NaN
6/30/2005   1625.60     113.80         0.00  113.80          NaN
7/31/2005   1636.80     114.58         0.00  114.58          NaN
8/31/2005   1700.80     119.06         0.00  119.06          NaN
9/30/2005   1267.20      88.71         0.00   88.71          NaN
10/31/2005  2956.80     206.99         0.00  206.99          NaN
11/30/2005  1689.60     118.28         0.00  118.28          NaN
12/31/2005  1689.60     118.28         0.00  118.28          NaN
1/31/2006   1520.64     106.44         0.00  106.44          NaN
2/28/2006   1351.68      94.60         0.00   94.60          NaN
3/31/2006   2027.52     141.90         0.00  141.90          NaN
4/30/2006   1689.60     118.28         0.00  118.28          NaN
5/31/2006   1689.60     118.28         0.00  118.28          NaN
6/30/2006   1351.68      94.60         0.00   94.60          NaN
7/31/2006   1520.64     106.44         0.00  106.44          NaN
8/31/2006   1688.55     118.20         0.00  118.20          NaN
9/30/2006   2534.40     177.42         0.00  177.42          NaN
10/31/2006  1689.60     118.28         0.00  118.28          NaN
11/30/2006  1689.07     118.24         0.00  118.24          NaN
12/31/2006  1689.08     118.24         0.00  118.24  1578.125167
1/31/2007   1689.60     118.28         0.00  118.28  1597.534833
2/28/2007   1688.54     118.20         0.00  118.20  1608.176500

In [99]:
# Compare this to my samp_avg_salary.xlsx. Samp_avg_salary is only applicable to export_format.csv at this time
# Note that the excel workbook is also computing 60 month averages,
# Using two separate methods to compute the same outcome, I can check my work
# but, since my key is only available on one example source, I need to rerun all those cells with a different source file
# I wanted to run it on example 4 to start though, because it has the commas issue, and I wanted to show how to fix that with examples
df = pd.read_csv('export_format.csv')
# For this file export in particular, the member evidently did not have a high salary, and there were no commas
# So, pandas already labeled the column as float64, and not an object, due to no commas
# Because there were no commas to replace, this line of code was breaking the program. So, I commented it out.
#df['salary'] = df['salary'].str.replace(',', '') 
df['salary'] = pd.to_numeric(df['salary'])
df = df.groupby('period_end').sum()
df = df.sort_values(by='period_end', key=pd.to_datetime)
df['rolling_60'] = df['salary'].rolling(60).mean()


df.tail(15)

C:\Users\Admin\AppData\Local\Temp\ipykernel_4716\1091875290.py:12: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df = df.groupby('period_end').sum()

              salary  sheltered  unsheltered   total   rolling_60
period_end
5/31/2021    6881.82     481.72          0.0  481.72  6291.540500
6/30/2021    6881.81     481.72          0.0  481.72  6379.814000
7/31/2021    9480.96     663.66          0.0  663.66  6516.691333
8/31/2021    7056.90     493.98          0.0  493.98  6610.742833
9/30/2021    7056.93     493.98          0.0  493.98  6700.069500
10/31/2021   8047.49     563.32          0.0  563.32  6811.563333
11/30/2021   8341.16     583.88          0.0  583.88  6922.294000
12/31/2021  10840.73     758.85          0.0  758.85  7097.314833
1/31/2022    7192.15     503.45          0.0  503.45  7132.009167
2/28/2022    7237.23     506.60          0.0  506.60  7146.029833
3/31/2022    8549.38     598.45          0.0  598.45  7195.089833
4/30/2022    8652.05     605.64          0.0  605.64  7229.351333
5/31/2022    8898.70     622.90          0.0  622.90  7283.091833
6/30/2022    7237.25     506.60          0.0  506.60  7307.999667
7/31/2022   10013.83     700.96          0.0  700.96  7347.837000

In [100]:
# The numbers above do NOT match the expected values.....why? 
# I'll have to check some others ....